name: "llava_trt_ensemble"
platform: "ensemble"
max_batch_size: 1

input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "image"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]
output [
  {
    name: "output_ids"
    data_type: TYPE_INT32
    dims: [ -1, -1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "llava_trt_vision"
      model_version: -1
      input_map {
        key: "text_input"
        value: "text_input"
      }
      input_map {
        key: "image"
        value: "image"
      }
      output_map {
        key: "input_ids"
        value: "input_ids"
      }
      output_map {
        key: "prompt_embedding_table"
        value: "prompt_embedding_table"
      }
      output_map {
        key: "request_output_len"
        value: "request_output_len"
      }
      output_map {
        key: "prompt_vocab_size"
        value: "prompt_vocab_size"
      }

      output_map {
        key: "input_lengths"
        value: "input_lengths"
      }
    },
    {
      model_name: "llava_trt_llm"
      model_version: -1
      input_map {
        key: "input_ids"
        value: "input_ids"
      }
      input_map {
        key: "input_lengths"
        value: "input_lengths"
      }
      input_map {
        key: "request_output_len"
        value: "request_output_len"
      }
      input_map {
        key: "prompt_embedding_table"
        value: "prompt_embedding_table"
      }
      input_map {
        key: "prompt_vocab_size"
        value: "prompt_vocab_size"
      }
      output_map {
        key: "output_ids"
        value: "output_ids"
      }
    }
  ]
}
